/*
 * @Descripttion:
 * @version:
 * @Author: big bug
 * @Date: 2019-09-17 16:00:43
 * @LastEditTime: 2019-09-27 16:28:49
 */
import http from '../http/index.js';

/**
 *登录接口
 */
export function login(params) {
  if (params.username == 'admin' && params.password == 'admin') {
    return {
      code: 0,
      data: {
        status: 1,
        user: {
          username: 'admin',
          headImg: 'https://gss2.bdstatic.com/-fo3dSag_xI4khGkpoWK1HF6hhy/baike/c0%3Dbaike92%2C5%2C5%2C92%2C30/sign=36ba11c723f5e0fefa1581533d095fcd/eac4b74543a98226095935f98482b9014b90eb50.jpg'
        },
        token: 'admin',
        msg: '登陆成功'
      }
    }
  } else {
    return {
      code: 0,
      data: {
        status: 0,
        msg: '用户名或密码错误'
      }
    }
  }
}

/**
 * 注销登录接口
 */
export function logout() {
  return {
    code: 0,
    data: {
      status: 0,
      user: {},
      token: '',
      msg: '注销成功'
    }
  }
}

/**
 * 修改密码接口
 */


/**
 * 提交表单接口
 */
export function getAllMsg(params) {
  return http.post(`/textservice/allmsg`,params);
  return {
    "code": 0,
    "msg": " ",
    "data": {
      "summary": {
        "maxSentence":
          "因此切词的准确性在很大程度上影响着后续的处理，切词结果的不同，也就影响了特征的提取，跟数据挖掘一样，特征提取的好坏特别重要，不论用什么3月26日讯。",
        "midSentence":
          "也就影响了特征的提取，跟数据挖掘一样，特征提取的好坏特别重要，不论用什么3月26日讯。",
        "minSentence":
          "特征提取的好坏特别重要，不论用什么3月26日讯。"
      },
      "key_words": {
        "maxKeyWordMap": {
          "切词": 16.0, "影响": 8.0, "中国": 6.0, "稀土": 6.0, "王牌": 6.0, "牌桌": 6.0, "头先": 6.0, "标题": 6.0, "日讯": 4.0, "跌幅": 4.0, "网络": 4.0,
          "领域": 4.0, "新词": 4.0, "非常": 4.0, "课题": 4.0, "处理": 4.0, "文本": 4.0, "对象": 4.0, "关键": 4.0, "问题": 4.0
        },
        "midKeyWordMap":
        {
          "切词": 16.0, "影响": 8.0, "中国": 6.0, "稀土": 6.0, "王牌": 6.0, "牌桌": 6.0, "头先": 6.0, "标题": 6.0, "日讯": 4.0, "跌幅": 4.0, "网络":
            4.0, "领域": 4.0, "新词": 4.0, "非常": 4.0, "课题": 4.0
        },
        "minKeyWordMap": {
          "切词": 16.0, "影响": 8.0, "中国": 6.0, "稀土": 6.0, "王牌":
            6.0
        }
      },
      "new_words": ['减贫','中国人','方队长朱德','着重练好'],
      "topic_type": [
        {
          "topic_weight": 0.293,
          "topic": 189,
          "topic_word": [
            "数据", "进行", "系统", "分析", "信息"]
        },
        { "topic_weight": 0.104, "topic": 279, "topic_word": ["黄金", "行情", "支撑", "反弹", "走势"] }, {
          "topic_weight": 0.1,
          "topic": 37, "topic_word": ["问题", "是否", "需要", "存在", "导致"]
        },
        {
          "topic_weight": 0.088, "topic": 152, "topic_word": ["股价",
            "个股", "板块", "指数", "买入"]
        },
        { "topic_weight": 0.078, "topic": 197, "topic_word": ["名单", "限制", "公布", "部分", "单位"] }
      ],
      "entity_words": {
        "PER": [], "LOC": [], "ORG": [], "DATE": ["3月26日"], "RATIO": [], "NUM": []
      },
      "sentiment": "neg",
      "wordtag": {
        "日讯": "其他专名", "今日": "时间词", "沪指": "简称略语", "高开低走": "习用语", "一路": "数词", "震荡": "动词", "下行": "动词", "午后": "时间词",
        "跌幅": "名词", "进一步": "副词", "扩大": "动词", "最终": "副词", "失守": "动词", "网络": "名词", "领域": "名词", "新词": "名词", "发现": "动词", "一个": "数词",
        "非常": "副词", "重要": "形容词", "nlp": "英文单词", "课题": "名词", "处理": "动词", "文本": "名词", "对象": "名词", "关键": "名词", "问题": "名词", "在于":
          "动词", "切词": "名词", "环节": "名词", "几乎": "副词", "所有": "区别词", "后续": "动词", "依赖": "动词", "第一步": "数词", "准确性": "名词", "很大": "形容词",
        "程度": "名词", "影响": "名动词", "不同": "形容词", "特征": "名词", "提取": "动词", "数据挖掘": "名词", "特征提取": "人名", "好坏": "动词", "特别": "副词"
      },
      "regions":"河北省_廊坊市_固安县"
    }
  }
}
